AcDbAssocCreateImpObject
This is mostly for internal use.
A way to tell the API class constructor whether it should create the
corresponding imp object derived from AcDbImpObject, or whether the derived
API class constructor is going to create its derived imp object.
When the base class constructor is called from the derived class
constructor, the AcDbAssocCreateImpObject argument should be passed as
kAcDbAssocDoNotCreateImpObject so that the base class does not create an
imp object, the derived class constructor will create its own derived-class
imp object. When the base class constructor is called by client code in
order to create a concrete object, the AcDbAssocCreateImpObject argument
should be passed as kAcDbAssocCreateImpObject, or omitted, and the constructor
will then create the corresponding imp object.